Repository: FacundoAdorno/FLTube
Catalog: locales/*/LC_MESSAGES/FLTube.po
Languages: es

source: Invalid configuration at property '%s' (CURRENT VALUE: %s). Please, modify it to a valid integer value.
es: Configuración inválida en la propiedad '%s' (VALOR ACTUAL: %s). Por favor, modifica este valor por un entero válido.

source: Invalid configuration at property '%s' (CURRENT VALUE: %s). Value out of range: %s.
es: Configuración inválida en la propiedad '%s' (VALOR ACTUAL: %s). Valor fuera de rango: %s.

source: Keybinding for shortcut '%s' already in use. Please, change it for an unused combination of keys.
es: La combinación de teclas para el atajo '%s' ya está en uso. Por favor, cámbielo por una combinación de teclas que no esté en uso.

source: Invalid keybinding for shortcut '%s'. Please, change it for a valid combination of keys.
es: Combinación de teclas inválida para el atajo '%s'. Por favor, cámbielo por una combinación de teclas válida.

source: Cleaning temporal files at %s.
es: Eliminando archivos temporales en %s.

source: Closing FLtube... Bye!
es: Cerrando FLTube... ¡Adiós!

source: Resource image at '%s' cannot be loaded...
es: El recurso de imágen en '%s' no puede ser cargado...

source: FLTube Help
es: Ayuda de FLTube

source: Version %s
es: Versión %s

source: FLTube is an application for search & stream Youtube videos. You can search by a search term or by entering the URL of a specific YouTube video. Once the results are returned, you can watch any of these videos by clicking on their thumbnail. The stream resolution is 360p by default, but can be changed at fltube.conf configuration file. You can also view the latest videos by the creator of a specific video by clicking on their name (a button at the bottom right of each result). If a search returns multiple results, they will be paginated, and you can navigate through them using the "<Previous" and "Next>" buttons at the bottom of the window.
es: FLTube es una aplicación para buscar y stremear videos de Youtube. Puedes buscar por término de búsqueda o entrando la URL de un video de YouTube específico. Una vez se retornen los resultados, puedes mirar cualquiera de esos videos haciendo clic en su miniatura. La resolución de streaming es 360p por defecto, pero puede cambiarse en el archivo fltube.conf. También puedes ver los últimos videos del creador de un video específico haciendo clic en su nombre (un botón debajo a la derecha de cada resultado). Si una búsqueda retorna múltiples resultados, aparecerán paginados, y puedes navegar a través de éstos usando los botones "<Previo" y "Siguiente>" en la parte inferior de la ventana.

source: - Focus at search input: %s - Search videos: %s - Get previous results: %s - Get next results: %s - Open video 1: %s - Open video 2: %s - Open video 3: %s - Open video 4: %s - Search videos of Channel 1: %s - Search videos of Channel 2: %s - Search videos of Channel 3: %s - Search videos of Channel 4: %s - Show this Help Window: %s [NOTE] Default shortcuts can be modified at %s.
es: - Enfocar el cuadro de búsqueda: %s - Buscar videos: %s - Obtener resultados anteriores: %s - Obtener resultados siguientes: %s - Abrir video 1: %s - Abrir video 2: %s - Abrir video 3: %s - Abrir video 4: %s - Buscar videos del Canal 1: %s - Buscar videos del Canal 2: %s - Buscar videos del Canal 3: %s - Buscar videos del Canal 4: %s - Mostrar esta ventana de ayuda: %s [NOTA] Los atajos por defecto puede ser modificados en el archivo de configuración %s.

source: Your device is offline. Check your internet connection.
es: Tu dispositivo está fuera de línea. Revisa tu conexión a internet.

source: There seems that you don't have access to the Internet. Please, verify you network connection before proceed...
es: Parece que no tienes conexión a Internet. Por favor, verifica tu conexión de red antes de proceder...

source: Starting streaming preview of video '%s' - (%s)...
es: Iniciando previsualización del video '%s' - (%s)...

source: Cannot get video URL. Review the video metadata enabling app debugging...
es: No se puede descargar URL de video. Revisa los metadatos del video habilitando el debugging de la app...

source: viewers
es: viendo

source: views
es: vistas

source: Error when getting count of viewers of video: (title: "%s", ID: "%s")
es: Error al obtener cantidad de espectadores de un video: (título: "%s", ID: "%s")

source: Unknown
es: Desconocido

source: Something went wrong when generating a resize thumbnail for video with ID=
es: Algo falló al generar una miniatura re-escalada para el video con ID=

source: Loading configurations from
es: Cargando configuraciones desde

source: yt-dlp is not installed on your system or its binary is not at $PATH system variable. See how to install it at https://github.com/yt-dlp/yt-dlp. Or run in a terminal the 'install_yt-dlp' script.
es: yt-dlp no está instalado en tu sistema ó su binario no se encuentra en el variable $PATH del sistema. Instalalo desde https://github.com/yt-dlp/yt-dlp. Ó ejecuta en una terminal el comando 'install_yt-dlp'.

source: yt-dlp is not installed. Closing app...
es: yt-dlp no está instalado. Cerrando app...

source: Default streaming resolution (360p) changed at configuration to this new resolution:
es: Resolución de streaming por defecto (360p) fue cambiada mediante configuración a esta nueva resolución:

source: Searching for results for '%s' user input...
es: Buscando resultados para la entrada del usuario: '%s' ...

source: For now, only Youtube URL's are valid for download. Please, edit your input text or search using a generic term.
es: Por ahora, sólo URL's de Youtube son válidas para descargar. Por favor, edita tu entrada ó realiza una búsqueda por término de búsqueda.

source: The Fl_Button is inexistent when search videos for a channel!!!
es: El FL_Button es inexistente al hacer búsqueda de videos para un canal!!!

source: Channel ID is empty. Please verify the video metadata initilization!!!
es: El ID del Canal es inexistente. Por favor, verifica la inicialización de los metadatos del video!!!

source: The Fl_Input search widget inexistent!!!
es: El widget de búsqueda FL_Input no existe!!!

source: Search input is empty. Please, retry and enter a valid text.
es: La entrada está vacía. Por favor, re-inténtalo e ingresa un texto válido.

source: Loading custom config file %s.
es: Cargando archivo de configuración personalizado: %s.

source: Specified path at --config parameter does not exist.
es: La ruta especificada en el parámetro --config no existe.

source: --config parameter with no path specified.
es: El parámetro --config no especifica una ruta de archivo.

source: DEBUG MODE enabled.
es: MODO DEBUG habilitado.

source: Starting FLTube v.%s
es: Iniciando FLTube v.%s

source: The FLTube main window has loaded.
es: La ventana principal de FLTube ha sido cargada.

source: There was an error executing the following command: %s
es: Se produjo un error al ejecutar el siguiente comando: %s

source: Closing the program due to an error.
es: Cerrando el programa debido a un error.

source: Connection testing failure: %s. Check your connectivity.
es: Prueba de conexión fallida: %s. Verifica tu conectividad.

source: Search box:
es: Caja de búsqueda:

source: Term or URL
es: Término o URL

source: Enter a search term for search or a valid Youtube URL.
es: Introduzca un término de búsqueda para buscar, ó una URL de Youtube válida.

source: Go &search!
es: ¡Bu&scar!

source: If search by URL, it must be a complete one (i.e. https://youtu.be/12345)...
es: Si busca por URL, debe estar completa (por ejemplo, https://youtu.be/12345)...

source: <&Previous
es: <&Previo

source: Get previous results of current search results set.
es: Obtener resultados anteriores del conjunto de resultados de búsqueda actual.

source: &Next>
es: Siguie&nte>

source: Get following results of current search results set.
es: Obtenga los siguientes resultados del conjunto de resultados de búsqueda actual.

source: Help
es: Ayuda

source: Show info about this application and some help of how to use it.
es: Mostrar información sobre la aplicación y ayuda sobre cómo utilizarla.

source: Click to stream the video (preview it)...
es: Clic para streamear el video (previsualizarlo)...

source: Total video views, or if live current count of concurrent spectators.
es: Visualizaciones totales de un video, ó si es un video en vivo, la cantidad de espectadores en concurrente.

source: The video is live.
es: Este video está en vivo.

source: Duration expressed as H:MM:SS.
es: Duración expresada como H:MM:SS.

source: Video upload date.
es: Fecha de carga del video.

source: Click to list all channel's video.
es: Haga clic para ver todos los vídeos del canal.

source: Close and exit
es: Cerrar y salir

source: Accept
es: Aceptar

source: Cancel
es: Cancelar

source: Don't warn me again and ACCEPT always.
es: No advertirme de vuelta y aceptar siempre.

source: Check if don't want to be warn again, assuming all risks.
es: Marca si no quieres volver a avisar, asumiendo todos los riesgos.

source: Version x.y.z
es: Versión x.y.z

source: Watch YouTube videos in your very old PC.
es: Mira videos de YouTube en tu antigua PC.

source: Technologies:
es: Tecnologías:

source: Source code at:
es: Código fuente:

source: Licensed under GNU GPL v3.0.
es: Licenciado bajo GNU GPL v3.0.

source: Click to open FLTK official website.
es: Haz clic para abrir el sitio web oficial de FLTK.

source: Click to open FLTube repository.
es: Haz clic para abrir el repositorio de FLTube.

source: Click to open yt-dlp official website.
es: Haz clic para abrir el sitio web oficial de yt-dlp.

source: Click to open C++ official website.
es: Haz clic para abrir el sitio web oficial de C++.

source: How to use
es: Cómo se usa

source: Shortcuts
es: Atajos
