Repository: FacundoAdorno/FLTube
Catalog: locales/*/LC_MESSAGES/install_yt-dlp.po
Languages: es

source: [ == HELP == ] Use this script to INSTALL or UPDATE the 'yt-dlp' tool in your system, besides it installs the External JS Runtime required since 'yt-dlp@2025.11.12' (QuickJS@%s). Advice that this software require that Python 3.X been installed on your system (more info at: %s). USAGE: install_yt-dp [options] OPTIONS: -p Alternative PATH for binary installation/update. It must exists in case of installation. Default directory is '%s'. -j Only download javascript runtime (QuickJS@%s) and exit. -y Confirm all questions. Avoid interaction with script and accept all. -h, Show this usage help.
es: [ == AYUDA == ] Usa este script para INSTALAR o ACTUALIZAR la herramienta 'yt-dlp' en tu sistema, además de instalar el External JS Runtime requerido desde 'yt-dlp@2025.11.12' (QuickJS@%s). Advierte que este software requiere que Python 3.X esté instalado en su sistema (más información en: %s). USO: install_yt-dp [opciones] OPCIONES: -p Ruta alternativa para la instalación/actualización del binario. Debe existir en caso de instalación. El directorio predeterminado es '%s'. -y Confirma todas las preguntas. Evita la interacción con el script y acepta todo. -j Sólo instala el javascript runtime (QuickJS@%s) y termina la ejecución. -h, Muestra este texto de ayuda.

source: '%s' does not exists. Do you want to create it?
es: '%s' No existe. ¿Deseas crearlo?

source: Directory '%s' created.
es: Directorio '%s' creado.

source: You must create '%s' before procced. Aborting installation...
es: Debes crear '%s' antes de proceder. Abortando instalación...

source: Starting 'yt-dlp' DOWNLOAD...
es: Comenzando la DESCARGA de 'yt-dlp'...

source: 'yt-dlp' installed at %s/yt-dlp path.
es: 'yt-dlp' instalado en la ruta %s/yt-dlp.

source: Starting 'quickjs@%s' DOWNLOAD...
es: Comenzando la DESCARGA de 'QuickJS@%s'...

source: 'quickjs' installed at %s/%s path.
es: 'QuickJS' instalado en la ruta %s/%s.

source: 'quickjs' cannot be downloaded for some reason. Download manually or run this script again...
es: 'QuickJS' no puede ser descargado por alguna razón. Descargalo manualmente o ejecuta este script nuevamente...

source: 'yt-dlp' is installed globally at your system %s. Maybe is installed as a system package. Is recommended to use this script for download the latest 'yt-dlp' version. Do you want to continue and install another 'yt-dlp' binary on your system?
es: 'yt-dlp' está instalado globalmente en el sistema %s. Quizás como un paquete del sistema. Es recomendable utilizar este script para descargar la última versión de 'yt-dlp'. ¿Deseas continuar e instalar otro binario de 'yt-dlp' en el sistema?

source: 'yt-dlp' is not in your system. Do you want to install at '%s'?
es: 'yt-dlp' no está instalado en tu sistema. ¿Deseas instalarlo en '%s'?

source: Installation aborted by user choice...
es: Instalación abortada por elección del usuario...

source: Do you want to update 'yt-dlp@%s' to any NEW VERSION (if any)?
es: ¿Deseas actualizar 'yt-dlp@%s' a una NUEVA VERSIÓN (si es que hay otra más reciente)?

source: yt-dlp update process aborted by user choice...
es: actualización abortada por elección del usuario...
